app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "total_paginas", "revision_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "A menina do Vale"], ["author", "Bel Pesce"], ["total_paginas", 100], ["revision_number", "2"], ["created_at", "2016-07-03 15:15:04.806385"], ["updated_at", "2016-07-03 15:15:04.806385"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "total_paginas" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["total_paginas", 1000], ["updated_at", "2016-07-03 12:30:43.752725"], ["id", 1]]