app/controllers/musics_controller.rb

SELECT "musics".* FROM "musics"
---
  def index
    @musics = Music.all

INSERT INTO "musics" ("artist", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["artist", "Justin Bieber"], ["name", "Sorry"], ["created_at", "2016-07-03 12:46:37.412163"], ["updated_at", "2016-07-03 12:46:37.412163"]]
---
  def create
    @music = Music.new(music_params)

    respond_to do |format|
      if @music.save

SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_music
      @music = Music.find(params[:id])